import React from 'react';


export default function Tos() {
    return (
        <div>
            <h4>제1조 (목적)</h4>
            본 약관은 개인이 제공하는 발로란트 내전봇 서비스(이하 "서비스")를 이용함에 있어 이용자와 서비스 제공자 간의 권리, 의무 및 책임 사항을 규정함을 목적으로 합니다.

            <h4>제2조 (용어의 정의)</h4>
            <ol>
                <li>"이용자"란 본 약관에 따라 서비스에 접속하여 본 약관을 읽고 동의한 자를 말합니다.</li>
                <li>"서비스 제공자"란 개인이 운영하는 발로란트 내전봇 서비스를 말합니다.</li>
            </ol>
            <h4>제3조 (서비스 이용)</h4>
            <ol>
                <li>이용자는 본 약관을 읽고 동의해야만 서비스를 이용할 수 있습니다.</li>
                <li>서비스 이용 중 이용자의 부주의로 발생하는 모든 일에 대한 책임은 전적으로 이용자 본인에게 있으며, 서비스 제공자는 이에 대한 어떠한 책임도 지지 않습니다.</li>
            </ol>
            <h4>제4조 (책임의 한계)</h4>
            <ol>
                <li>서비스 제공자는 이용자가 서비스를 이용함에 있어 발생하는 모든 손해에 대해 어떠한 배상도 하지 않습니다.</li>
                <li>이용자는 이 점을 충분히 이해하고 동의한 후 서비스를 이용해야 합니다.</li>
            </ol>
            <h4>제5조 (약관의 변경)</h4>
            <ol>
                <li>서비스 제공자는 필요한 경우 본 약관을 변경할 수 있으며, 변경된 약관은 공지 후 즉시 효력이 발생합니다.</li>
                <li>이용자는 변경된 약관에 대해 동의하지 않을 경우 서비스 이용을 중단할 수 있습니다.</li>
            </ol>
        </div>
    );
}